weatherexercise/target/classes/examples/countryCurrency.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CountryCurrency xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>CountryCurrency</sCountryISOCode>
        </CountryCurrency>
    </Body>
</Envelope>